# YOLO11n-p2 object detection model
# P2/4 - P5/32 outputs
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.75, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs -> 960x 51.0 GFLOPs
  m: [0.75, 0.75, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs -> 960x 153.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs -> 960x 155.9 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# ─────────── backbone ───────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2
  - [-1, 1, A2C2f, [256, False, 0.5]]    # 3
  - [-1, 1, Conv,  [256, 3, 2]]         # 4-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 5
  - [-1, 1, A2C2f, [512, False, 0.5]]    # 6
  - [-1, 1, Conv,  [512, 3, 2]]         # 7-P4/16
  - [-1, 1, C3k2,  [512, True]]         # 8
  - [-1, 2, A2C2f, [512, False, 4]]         # 9
  - [-1, 1, Conv,  [1024, 3, 2]]        # 10-P5/32
  - [-1, 1, C3k2,  [1024, True]]        # 11
  - [-1, 2, A2C2f, [1024, False, 1]]        # 12
  - [-1, 1, SPPF,  [1024, 5]]           # 13
  - [-1, 2, C2PSA, [1024]]              # 14

# ─────────── head (small-object-oriented) ───────────
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 15
  - [[-1, 9], 1, Concat, [1]]                        # 16  ← 与 backbone P4 拼接
  - [-1, 2, C3k2, [512, False]]                      # 17
  - [-1, 1, A2C2f, [512, False, -1]]                 # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 19
  - [[-1, 6], 1, Concat, [1]]                        # 20  ← 与 backbone P3 拼接
  - [-1, 3, A2C2f, [256, False, -1]]                 # 21  (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 22
  - [[-1, 1], 1, Concat, [1]]                        # 23  ← 与 backbone P2 拼接
  - [-1, 2, A2C2f, [128, False, -1]]                 # 24  (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]                       # 25
  - [[-1, 21], 1, Concat, [1]]                       # 26  ← 下采样再与 P3 拼接
  - [-1, 2, A2C2f, [256, False, -1]]                 # 27  (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                       # 28
  - [[-1, 18], 1, Concat, [1]]                       # 29  ← 再下采样与 P4 拼接
  - [-1, 2, C3k2, [512, False]]                      # 30  (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                       # 31
  - [[-1, 14], 1, Concat, [1]]                       # 32  ← 再下采样与 P5 拼接
  - [-1, 2, A2C2f, [1024, False, -1]]                 # 33  (P5/32-large)

  - [[24, 27, 30, 33], 1, Detect, [nc]]              # Detect(P2, P3, P4, P5)
